//-----------------------------------------------------------------------------
//
//      Базовый класс подготовки данных для отправки клиентам
//      (c) РГУПС, ВЖД 13/07/2017
//      Разработал: Ковшиков С. В.
//
//-----------------------------------------------------------------------------
/*!
 * \file
 * \brief Базовый класс подготовки данных для отправки клиентам
 * \copyright РГУПС, ВЖД
 * \author Ковшиков С. В.
 * \date 13/07/2017
 */


#include "abstract-data-prepare-engine.h"



//-----------------------------------------------------------------------------
// КОНСТРУКТОР
//-----------------------------------------------------------------------------
AbstractDataPrepareEngine::AbstractDataPrepareEngine()
    : QObject(Q_NULLPTR)
{

}



//-----------------------------------------------------------------------------
//
//-----------------------------------------------------------------------------
void AbstractDataPrepareEngine::setDataFromClient(client_cmd_t dataFromClient)
{
    Q_UNUSED(dataFromClient);
}
