//-----------------------------------------------------------------------------
//
//      Класс отсутствия подготовки данных
//      (c) РГУПС, ВЖД 13/07/2017
//      Разработал: Ковшиков С. В.
//
//-----------------------------------------------------------------------------
/*!
 * \file
 * \brief Класс отсутствия подготовки данных
 * \copyright РГУПС, ВЖД
 * \author Ковшиков С. В.
 * \date 13/07/2017
 */

#include "null-data-prepare-engine.h"


//-----------------------------------------------------------------------------
// КОНСТРУКТОР
//-----------------------------------------------------------------------------
NullDataPrepareEngine::NullDataPrepareEngine()
    : AbstractDataPrepareEngine()
{

}



//-----------------------------------------------------------------------------
// Вернуть пустой массив данных
//-----------------------------------------------------------------------------
QByteArray NullDataPrepareEngine::getPreparedData()
{
    return QByteArray(0, Qt::Uninitialized);
}
